; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph2 - mode
	spectrograph3 - mode
	thermograph0 - mode
	infrared1 - mode
	thermograph4 - mode
	GroundStation0 - direction
	Star3 - direction
	Star6 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	Star12 - direction
	Star14 - direction
	Star4 - direction
	GroundStation9 - direction
	GroundStation7 - direction
	Star1 - direction
	GroundStation10 - direction
	GroundStation5 - direction
	GroundStation13 - direction
	GroundStation2 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Star18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation7)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation13)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation10)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
)
(:goal (and
	(pointing satellite0 GroundStation9)
	(pointing satellite1 Planet19)
	(have_image Planet15 spectrograph2)
	(have_image Phenomenon16 spectrograph3)
	(have_image Star17 thermograph0)
	(have_image Star18 infrared1)
	(have_image Planet19 spectrograph3)
))

)

; plan
1. (turn_to satellite1 groundstation10 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 groundstation10)
   goals met: 0 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite1 instrument3 groundstation10)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon16 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 7
5. (turn_to satellite0 groundstation9 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 groundstation9)
   goals met: 1 of 7
6. (take_image satellite1 phenomenon16 instrument3 spectrograph3)
   added: (have_image phenomenon16 spectrograph3)
   goals met: 2 of 7
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 7
8. (calibrate satellite0 instrument1 groundstation9)
   added: (calibrated instrument1)
   goals met: 2 of 7
9. (turn_to satellite0 planet15 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 planet15)
   goals met: 1 of 7
10. (take_image satellite0 planet15 instrument1 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 2 of 7
11. (turn_to satellite0 star17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star17)
   goals met: 2 of 7
12. (take_image satellite0 star17 instrument1 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 3 of 7
13. (turn_to satellite0 star18 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star18)
   goals met: 3 of 7
14. (take_image satellite0 star18 instrument1 infrared1)
   added: (have_image star18 infrared1)
   goals met: 4 of 7
15. (turn_to satellite0 groundstation9 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 groundstation9)
   goals met: 5 of 7
16. (turn_to satellite1 planet19 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet19)
   goals met: 6 of 7
17. (take_image satellite1 planet19 instrument3 spectrograph3)
   added: (have_image planet19 spectrograph3)
   goals met: 7 of 7
